# coding: utf8
"""Contains wrong Urdu characters mapping to correct characters"""
from typing import Dict

CORRECT_URDU_CHARACTERS: Dict[str:list] = {'آ': ['ﺁ', 'ﺂ'],
                                           'ا': ['ﺍ', 'ﺎ', ],
                                           'ب': ['ﺏ', 'ﺐ', 'ﺑ', 'ﺒ'],
                                           'پ': ['ﭖ', 'ﭘ', 'ﭙ', ],
                                           'ت': ['ﺕ', 'ﺖ', 'ﺗ', 'ﺘ'],
                                           'ٹ': ['ﭦ', 'ﭧ', 'ﭨ', 'ﭩ'],
                                           'ث': ['ﺛ', 'ﺜ'],
                                           'ج': ['ﺝ', 'ﺞ', 'ﺟ', 'ﺠ'],
                                           'ح': ['ﺡ', 'ﺣ', 'ﺤ', 'ﺢ'],
                                           'خ': ['ﺧ', 'ﺨ', 'ﺦ'],
                                           'د': ['ﺩ', 'ﺪ'],
                                           'ذ': ['ﺬ', 'ﺫ'],
                                           'ر': ['ﺭ', 'ﺮ'],
                                           'ز': ['ﺯ', 'ﺰ', ],
                                           'س': ['ﺱ', 'ﺲ', 'ﺳ', 'ﺴ', ],
                                           'ش': ['ﺵ', 'ﺶ', 'ﺷ', 'ﺸ'],
                                           'ص': ['ﺹ', 'ﺺ', 'ﺻ', 'ﺼ', ],
                                           'ض': ['ﺽ', 'ﺾ', 'ﺿ', 'ﻀ'],
                                           'ط': ['ﻃ', 'ﻄ'],
                                           'ظ': ['ﻅ', 'ﻇ', 'ﻈ'],
                                           'ع': ['ﻉ', 'ﻊ', 'ﻋ', 'ﻌ', ],
                                           'غ': ['ﻍ', 'ﻏ', 'ﻐ', ],
                                           'ف': ['ﻑ', 'ﻒ', 'ﻓ', 'ﻔ', ],
                                           'ق': ['ﻕ', 'ﻖ', 'ﻗ', 'ﻘ', ],
                                           'ل': ['ﻝ', 'ﻞ', 'ﻟ', 'ﻠ', ],
                                           'م': ['ﻡ', 'ﻢ', 'ﻣ', 'ﻤ', ],
                                           'ن': ['ﻥ', 'ﻦ', 'ﻧ', 'ﻨ', ],
                                           'و': ['ﻮ', 'ﻭ', 'ﻮ', ],
                                           'چ': ['ﭺ', 'ﭻ', 'ﭼ', 'ﭽ'],
                                           'ڈ': ['ﮈ', 'ﮉ'],
                                           'ڑ': ['ﮍ', 'ﮌ'],
                                           'ژ': ['ﮋ', ],
                                           'ک': ['ﮎ', 'ﮏ', 'ﮐ', 'ﮑ'],
                                           'گ': ['ﮒ', 'ﮓ', 'ﮔ', 'ﮕ'],
                                           'ں': ['ﮞ', 'ﮟ'],
                                           'ھ': ['ﮪ', 'ﮬ', 'ﮭ', 'ﮨ', 'ﻬ', 'ﻫ'],
                                           'ہ': ['ﻩ', 'ﮦ', 'ﻪ', 'ﮧ', 'ﮩ', 'ﮫ'],
                                           'ۃ': [],
                                           'ی': ['ﯼ', 'ى', 'ﯽ', 'ﻰ', 'ﻱ', 'ﻲ', 'ﯾ', 'ﯿ'],
                                           'ے': ['ﮮ', 'ﮯ', 'ﻳ', 'ﻴ', ],
                                           '۰': [],
                                           '۱': [],
                                           '۲': [],
                                           '۳': [],
                                           '۴': [],
                                           '۵': [],
                                           '۶': [],
                                           '۷': [],
                                           '۸': [],
                                           '۹': [],
                                           }

_TRANSLATOR = {}
for key, value in CORRECT_URDU_CHARACTERS.items():
    _TRANSLATOR.update(dict.fromkeys(map(ord, value), key))


def normalize_characters(text: str) -> str:
    """
    Replace with correct Urdu unicode characters
    Args:
        text (str): text to replace

    Returns:
        str
    """
    return text.translate(_TRANSLATOR)
