# coding: utf8
"""Collection of stopwords for the Urdu language.
Maintainer: Ikram Ali(mrikram1989@gmail.com)
version = 2019.01.30
"""

# Urdu Language Stop words list
STOP_WORDS = frozenset("""

 آ آئی آئیں آئے آتا آتی آتے آخری آس آنا آنی آنے آپ گے آیا ابھی اجنبی از
 اس استعمال اسی اسے البتہ الف ان اندر انہوں انہی انہیں اور اوپر اپ اپنا اپنی اپنے اکثر اگر
 اگرچہ اگلے ایسا ایسی ایسے ایک اے بار بارے باوجود باہر بظاہر بعد بعض بغیر بلکہ بن بنا بناؤ
 بند بننا بھر بھریں بھی بہت بیس بے بڑی تا تاکہ تب تجھ تجھے تحت تر تم تمام تمہارا تمہاری
 تمہارے تمہیں تو تک تھا تھی تھیں تھے تیری جا جاؤ جائیں جائے جاتا جاتی جاتے جانی جانے جب
 جبکہ جس جن جنہوں جنہیں جو جگہ جہاں جیسا جیسوں جیسی جیسے حاصل حالانکہ حالاں حصہ خالی ختم خلاف
 خود درمیان دسترس دلچسپی دو دوبارہ دوران دوسرا دوسروں دوسری دوسرے دونوں دوں دکھائیں دی دیئے دیا دیتا دیتی
 دیتے دیر دینا دینی دینے دیکھو دیں دیے دے ذریعے رکھا رکھتا رکھتی رکھتے رکھنا رکھنی رکھنے رکھو رکھی
 رکھے رہ رہا رہتا رہتی رہتے رہنا رہنی رہنے رہو رہی رہیں رہے زیادہ سا ساتھ سامنے سب سو
 سکا سکتا سکتے سی سے شان شاید صرف صورت ضرورت ضروری طرح طرف طور علاوہ عین غیر لئے
 لا لائی لائے لاتا لاتی لاتے لانا لانی لانے لایا لو لگ لگا لگتا لگی لگیں لگے لہذا لی
 لیا لیتا لیتی لیتے لیکن لیں لیے لے مجھ مجھے مزید مقابلے مل مکمل مگر میرا میری میرے مطابق میں
 نا نہ نہیں نیچے نے واقعی والا والوں والی والے وجہ وغیرہ وہ وہاں وہی وہیں وی ویسے پاس
 پایا پر پوری پھر پہلا پہلے پیچھے چاہئے چاہتے چاہیئے چاہے چونکہ چکی ڈالا ڈالنا ڈالنی ڈالنے ڈالی ڈالیں
 ڈالے کئے کا کافی کب کبھی کر کرتا کرتی کرتے کرنا کرنے کرو کریں کرے کس کسی کسے کم
 کو کوئی کون کونسا کچھ کہ کہا کہاں کہہ کہیں کہے کی کیا کیسے کیونکہ کیوں کیے قریب کے گئی
 گئے گا گویا گی گیا گے گزشتہ ہاں ہر ہم ہمارا ہماری ہمارے ہمیشہ ہو ہوئی ہوئیں ہوئے ہوا ہوتا
 ہوتی ہوتیں ہوتے ہونا ہونگے ہونی ہونے ہوں ہی ہیں ہے یا یات یعنی یقینا یہ یہاں یہی یہیں

""".split())
